In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

subset = df["foo"]

subset.iloc[0] = 100

df

   foo  bar
0  100    4
1    2    5
2    3    6

In [3]:
pd.options.mode.copy_on_write = True

df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

subset = df["foo"]

subset.iloc[0] = 100

df

   foo  bar
0    1    4
1    2    5
2    3    6

In [4]:
pd.options.mode.copy_on_write = False

In [6]:
pd.options.mode.copy_on_write = "warn"

In [7]:
ser = pd.Series([1, 2, 3])

ser.to_numpy()

array([1, 2, 3], dtype=int64)

In [8]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

subset = df["foo"]

subset.iloc[0] = 100

df

C:\Users\YOSSI\AppData\Local\Temp\ipykernel_39680\83219138.py:5: FutureWarning: Setting a value on a view: behaviour will change in pandas 3.0.
You are mutating a Series or DataFrame object, and currently this mutation will
also have effect on other Series or DataFrame objects that share data with this
object. In pandas 3.0 (with Copy-on-Write), updating one Series or DataFrame object
will never modify another.

  subset.iloc[0] = 100

   foo  bar
0  100    4
1    2    5
2    3    6

In [9]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

df["foo"].replace(1, 5, inplace=True)

df

C:\Users\YOSSI\AppData\Local\Temp\ipykernel_39680\1394153153.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["foo"].replace(1, 5, inplace=True)
C:\Users\YOSSI\AppData\Local\Temp\ipykernel_39680\1394153153.py:3: FutureWarning: Setting a value on a view: behaviour will change in pandas 3.0.
You are mutating a Series or DataFrame object, and currently this mutation will
also have effect on other Series or DataFrame objects that share data with this
object. In pandas 3.0 (with Copy-on-Write), updating one Series or DataFrame object
will never modify another.

  df["foo"].replace(1, 5, inplace=True)

   foo  bar
0    5    4
1    2    5
2    3    6

In [10]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

df.replace({"foo": {1: 5}}, inplace=True)

df

   foo  bar
0    5    4
1    2    5
2    3    6

In [14]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

df["foo"] = df["foo"].replace(1, 5)

df

   foo  bar
0    5    4
1    2    5
2    3    6

In [15]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

df.iloc[0, 0] = 100

df

   foo  bar
0  100    4
1    2    5
2    3    6

In [16]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})

df

   foo  bar
0    1    4
1    2    5
2    3    6

In [17]:
df2 = df.reset_index(drop=True)
df2

   foo  bar
0    1    4
1    2    5
2    3    6

In [18]:
df2.iloc[0, 0] = 100

df

   foo  bar
0    1    4
1    2    5
2    3    6

In [19]:
df2

   foo  bar
0  100    4
1    2    5
2    3    6